Repository: davidwrighton/sdk
Catalog: src/CrossgenSdk/Resources/xlf/Strings.*.xlf
Languages: cs

# Crossgen2MissingRequiredMetadata
source: NETSDK1155: Required '{0}' metadata missing on Crossgen2Tool item.
cs: NETSDK1155: Prvek Crossgen2Tool neobsahuje povinná metadata '{0}'.

# Crossgen2ToolExecutableNotFound
source: NETSDK1152: Crossgen2Tool executable '{0}' not found.
cs: NETSDK1152: Spustitelný soubor Crossgen2Tool '{0}' nebyl nalezen.

# Crossgen2ToolMissingWhenUseCrossgen2IsSet
source: NETSDK1151: Crossgen2Tool must be specified when UseCrossgen2 is set to true.
cs: NETSDK1151: Crossgen2Tool musí být specifikován, pokud je UseCrossgen2 nastaven (true).

# Crossgen5CannotEmitSymbolsInCompositeMode
source: NETSDK1163: Cannot emit symbols when publishing for .NET 5 with Crossgen2 using composite mode.
cs: NETSDK1163: Publikování v .NET 5 s použitím Crossgen2 v kompozitním módu nepodporuje výstup symbolů.

# CrossgenToolExecutableNotFound
source: NETSDK1157: CrossgenTool executable '{0}' not found.
cs: NETSDK1157: Spustitelný soubor CrossgenTool '{0}' nebyl nalezen.

# CrossgenToolMissingInPDBCompilationMode
source: NETSDK1150: CrossgenTool not specified in PDB compilation mode.
cs: NETSDK1150: CrossgenTool není zadán v módu generování PDB.

# CrossgenToolMissingWhenUseCrossgen2IsNotSet
source: NETSDK1156: CrossgenTool must be specified when UseCrossgen2 is set to false.
cs: NETSDK1156: CrossgenTool musí být zadán, pokud je UseCrossgen2 neaktivní (false).

# DiaSymReaderLibraryNotFound
source: NETSDK1158: DiaSymReader library '{0}' not found.
cs: NETSDK1158: Knihovna DiaSymReader '{0}' nebyla nalezena.

# DotNetHostExecutableNotFound
source: NETSDK1153: .NET host executable '{0}' not found.
cs: NETSDK1153: Spustitelný soubor hostitele .NET '{0}' nebyl nalezen.

# InputAssemblyNotFound
source: NETSDK1160: Input assembly '{0}' not found.
cs: NETSDK1160: Vstupní modul '{0}' nebyl nalezen.

# JitLibraryNotFound
source: NETSDK1154: JIT library '{0}' not found.
cs: NETSDK1154: Knihovna JIT '{0}' nebyla nalezena.

# MissingOutputPDBImagePath
source: NETSDK1161: Missing output PDB path in PDB generation mode (OutputPDBImage metadata).
cs: NETSDK1161: Není zadán název výstupního PDB souboru v módu generování PDB (metadata OutputPDBImage).

# MissingOutputR2RImageFileName
source: NETSDK1162: Missing output R2R image path (OutputR2RImage metadata).
cs: NETSDK1162: Není zadán název výstupního R2R souboru (metadata OutputR2RImage).

# PDBGeneratorInputExecutableNotFound
source: NETSDK1159: PDB generation: R2R executable '{0}' not found.
cs: NETSDK1159: Generování PDB: spustitelný soubor R2R '{0}' nebyl nalezen.
